{
  "language": "Russian",
  "bringing_ideas_to_life": "Оживляем ваши идеи с помощью программ",
  "have_a_great_monday": "Хорошего понедельника!",
  "have_a_great_tuesday": "Хорошего вторника!",
  "have_a_great_wednesday": "Хорошей среды!",
  "have_a_great_thursday": "Хорошего четверга!",
  "have_a_great_friday": "Хорошей пятницы!",
  "have_a_great_saturday": "Хорошей субботы!",
  "have_a_great_sunday": "Хорошего воскресенья!",
  "experience": "Опыт",
  "ronfic_desc": "Разрабатываю и оптимизирую кроссплатформенные мобильные приложения на Flutter, обеспечивая их высокую производительность и удобство в поддержке. Активно работаю с REST API, Firebase и другими сервисами для интеграции внешних данных. Оптимизирую архитектуру приложений, провожу код-ревью и устраняю технические проблемы. Взаимодействую с клиентами и командой для разработки решений, соответствующих бизнес-требованиям. Участвую во всех этапах разработки — от проектирования и реализации до развертывания и поддержки.",
  "present": "настоящее время",
  "year": " год",
  "years": " года",
  "month": " месяц",
  "months": " месяца",
  "january": "Январь",
  "february": "Февраль",
  "march": "Март",
  "april": "Апрель",
  "may": "Май",
  "june": "Июнь",
  "july": "Июль",
  "august": "Август",
  "september": "Сентябрь",
  "october": "Октябрь",
  "november": "Ноябрь",
  "december": "Декабрь",
  "year_extended": " год",
  "busan_south_korea": "Бусан, Южная Корея",
  "ronfic": "Ronfic Co Ltd",
  "compass_x": "Compass X Co Ltd",
  "namangan_uzbekistan": "Наманган, Узбекистан",
  "compass_x_desc":"Как Flutter-разработчик, я проектировал и разрабатывал высокопроизводительные мобильные приложения на Flutter, уделяя особое внимание масштабируемости и поддерживаемости. Работал в тесном сотрудничестве с дизайнерами, backend-разработчиками и заказчиками, обеспечивая своевременную доставку функциональных решений. В мои обязанности входило написание чистого, оптимизированного кода, внедрение эффективных стратегий отладки и тестирования, а также оптимизация производительности приложений. Я регулярно проводил код-ревью, следил за соблюдением лучших практик разработки и изучал новые технологии. Кроме того, предоставлял технические рекомендации клиентам, помогая адаптировать решения под бизнес-требования, и принимал участие во всех этапах разработки — от идеи до публикации приложения.",
  "dongseo_university": "Университет Донсео",
  "dsu_exp1": "Наставлял начинающих студентов в изучении C++, объясняя основные концепции, лучшие практики и алгоритмическое программирование. Помогал с отладкой, оптимизацией кода и созданием проектов, развивая у студентов логическое мышление и навыки программирования.",
  "dsu_exp2": "Оказывал поддержку в проведении курса “Raspberry Pi и IoT”, помогая как на лекциях, так и в практических лабораторных занятиях. Содействовал освоению концепций Интернета вещей, интеграции оборудования и практической реализации проектов.",
  "dsu_exp3": "Отвечал за управление и регулярное обновление официального веб-сайта центра, обеспечивая точность контента, стабильную работу и удобство использования.",
  "dsu_exp4": "Оказывал поддержку начинающим студентам в изучении и освоении C++, помогая разобраться в основных концепциях, решении задач и лучших практиках программирования.",
  "dsu_exp5": "Выступал в роли связующего звена между офисом и студентами, обеспечивая эффективную коммуникацию, решение возникающих вопросов и координацию работы группы.",
  "education": "Образование",
  "bachelor_of_science": "Бакалавр наук в области компьютерной инженерии",
  "pnu": "Пусанский национальный университет",
  "master_of_science": "Магистр наук в области компьютерной инженерии",
  "dont_be_a_stranger": "Не стесняйся, просто\nскажи привет!"



}